# 1.2 - Intro Pandas

**[Documentación](https://pandas.pydata.org/docs/reference/index.html#api)**

**[Código fuente](https://github.com/pandas-dev/pandas)**

In [1]:
import pandas as pd

import numpy as np

**Series**

In [2]:
lst=[i*3+5 for i in range(5)]

lst

[5, 8, 11, 14, 17]

In [3]:
serie=pd.Series(lst)

serie

0     5
1     8
2    11
3    14
4    17
dtype: int64

In [4]:
#help(serie)

In [5]:
serie.head()   # dame la cabeza, por defecto, los primeros 5 elementos

0     5
1     8
2    11
3    14
4    17
dtype: int64

In [6]:
serie.head(2)

0    5
1    8
dtype: int64

In [7]:
serie.tail()   # dame la cola, por defecto, los primeros 5 elementos

0     5
1     8
2    11
3    14
4    17
dtype: int64

In [8]:
serie.index=['a', 'b', 'c', 'd', 'e']

In [9]:
serie

a     5
b     8
c    11
d    14
e    17
dtype: int64

In [10]:
serie[0]

5

In [11]:
serie['d']

14

**DataFrame**

In [12]:
matriz=np.random.random((10, 5))

In [13]:
columnas=['col1', 'col2', 'col3', 'col4', 'col5']

df=pd.DataFrame(matriz, columns=columnas)

df

       col1      col2      col3      col4      col5
0  0.146676  0.118623  0.402947  0.392031  0.098877
1  0.819809  0.692323  0.793818  0.697314  0.923216
2  0.763459  0.175158  0.419542  0.206395  0.134955
3  0.166614  0.883690  0.757813  0.739358  0.859827
4  0.572296  0.636675  0.690010  0.067800  0.903144
5  0.472438  0.710910  0.870906  0.107736  0.469061
6  0.047759  0.488078  0.721011  0.469763  0.674117
7  0.308565  0.742282  0.866000  0.978130  0.230489
8  0.722598  0.052784  0.513324  0.735041  0.610318
9  0.696129  0.979438  0.175888  0.263359  0.262100

In [15]:
type(df['col2'])

pandas.core.series.Series

In [16]:
df.col2

0    0.118623
1    0.692323
2    0.175158
3    0.883690
4    0.636675
5    0.710910
6    0.488078
7    0.742282
8    0.052784
9    0.979438
Name: col2, dtype: float64

In [17]:
lst_sel_col=['col3', 'col4']   # multiseleccion de columnas

df[lst_sel_col]

       col3      col4
0  0.402947  0.392031
1  0.793818  0.697314
2  0.419542  0.206395
3  0.757813  0.739358
4  0.690010  0.067800
5  0.870906  0.107736
6  0.721011  0.469763
7  0.866000  0.978130
8  0.513324  0.735041
9  0.175888  0.263359

In [18]:
df[['col3', 'col1', 'col4']]

       col3      col1      col4
0  0.402947  0.146676  0.392031
1  0.793818  0.819809  0.697314
2  0.419542  0.763459  0.206395
3  0.757813  0.166614  0.739358
4  0.690010  0.572296  0.067800
5  0.870906  0.472438  0.107736
6  0.721011  0.047759  0.469763
7  0.866000  0.308565  0.978130
8  0.513324  0.722598  0.735041
9  0.175888  0.696129  0.263359

In [21]:
df['col1'][0]

0.1466760874849906

In [23]:
len(df)   # numero de filas

10

In [22]:
df['nueva_col']=[i for i in range(len(df))]   # creacion de nueva columna

df

       col1      col2      col3      col4      col5  nueva_col
0  0.146676  0.118623  0.402947  0.392031  0.098877          0
1  0.819809  0.692323  0.793818  0.697314  0.923216          1
2  0.763459  0.175158  0.419542  0.206395  0.134955          2
3  0.166614  0.883690  0.757813  0.739358  0.859827          3
4  0.572296  0.636675  0.690010  0.067800  0.903144          4
5  0.472438  0.710910  0.870906  0.107736  0.469061          5
6  0.047759  0.488078  0.721011  0.469763  0.674117          6
7  0.308565  0.742282  0.866000  0.978130  0.230489          7
8  0.722598  0.052784  0.513324  0.735041  0.610318          8
9  0.696129  0.979438  0.175888  0.263359  0.262100          9

In [24]:
df.shape

(10, 6)

In [25]:
df['col10'] = df.col1 * df.col2 + df.col4  # creando una columna nueva

df

       col1      col2      col3      col4      col5  nueva_col     col10
0  0.146676  0.118623  0.402947  0.392031  0.098877          0  0.409430
1  0.819809  0.692323  0.793818  0.697314  0.923216          1  1.264887
2  0.763459  0.175158  0.419542  0.206395  0.134955          2  0.340121
3  0.166614  0.883690  0.757813  0.739358  0.859827          3  0.886592
4  0.572296  0.636675  0.690010  0.067800  0.903144          4  0.432167
5  0.472438  0.710910  0.870906  0.107736  0.469061          5  0.443596
6  0.047759  0.488078  0.721011  0.469763  0.674117          6  0.493074
7  0.308565  0.742282  0.866000  0.978130  0.230489          7  1.207173
8  0.722598  0.052784  0.513324  0.735041  0.610318          8  0.773183
9  0.696129  0.979438  0.175888  0.263359  0.262100          9  0.945174

In [27]:
df.col10=df.col3//df.col5  # sobreescribe la columna

df

       col1      col2      col3      col4      col5  nueva_col  col10
0  0.146676  0.118623  0.402947  0.392031  0.098877          0    4.0
1  0.819809  0.692323  0.793818  0.697314  0.923216          1    0.0
2  0.763459  0.175158  0.419542  0.206395  0.134955          2    3.0
3  0.166614  0.883690  0.757813  0.739358  0.859827          3    0.0
4  0.572296  0.636675  0.690010  0.067800  0.903144          4    0.0
5  0.472438  0.710910  0.870906  0.107736  0.469061          5    1.0
6  0.047759  0.488078  0.721011  0.469763  0.674117          6    1.0
7  0.308565  0.742282  0.866000  0.978130  0.230489          7    3.0
8  0.722598  0.052784  0.513324  0.735041  0.610318          8    0.0
9  0.696129  0.979438  0.175888  0.263359  0.262100          9    0.0

In [28]:
lst=[i for i in range(8)]

lst

[0, 1, 2, 3, 4, 5, 6, 7]

In [32]:
lst.append(None)
lst.append(None)

In [33]:
df['col11']=lst

In [34]:
df

       col1      col2      col3      col4      col5  nueva_col  col10  col11
0  0.146676  0.118623  0.402947  0.392031  0.098877          0    4.0    0.0
1  0.819809  0.692323  0.793818  0.697314  0.923216          1    0.0    1.0
2  0.763459  0.175158  0.419542  0.206395  0.134955          2    3.0    2.0
3  0.166614  0.883690  0.757813  0.739358  0.859827          3    0.0    3.0
4  0.572296  0.636675  0.690010  0.067800  0.903144          4    0.0    4.0
5  0.472438  0.710910  0.870906  0.107736  0.469061          5    1.0    5.0
6  0.047759  0.488078  0.721011  0.469763  0.674117          6    1.0    6.0
7  0.308565  0.742282  0.866000  0.978130  0.230489          7    3.0    7.0
8  0.722598  0.052784  0.513324  0.735041  0.610318          8    0.0    NaN
9  0.696129  0.979438  0.175888  0.263359  0.262100          9    0.0    NaN

In [35]:
df.dtypes

col1         float64
col2         float64
col3         float64
col4         float64
col5         float64
nueva_col      int64
col10        float64
col11        float64
dtype: object

In [36]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   col1       10 non-null     float64
 1   col2       10 non-null     float64
 2   col3       10 non-null     float64
 3   col4       10 non-null     float64
 4   col5       10 non-null     float64
 5   nueva_col  10 non-null     int64
 6   col10      10 non-null     float64
 7   col11      8 non-null      float64
dtypes: float64(7), int64(1)
memory usage: 768.0 bytes

In [38]:
df=df.fillna('hola')

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   col1       10 non-null     float64
 1   col2       10 non-null     float64
 2   col3       10 non-null     float64
 3   col4       10 non-null     float64
 4   col5       10 non-null     float64
 5   nueva_col  10 non-null     int64
 6   col10      10 non-null     float64
 7   col11      10 non-null     object
dtypes: float64(6), int64(1), object(1)
memory usage: 768.0+ bytes

In [42]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   col1       10 non-null     float64
 1   col2       10 non-null     float64
 2   col3       10 non-null     float64
 3   col4       10 non-null     float64
 4   col5       10 non-null     float64
 5   nueva_col  10 non-null     int64
 6   col10      10 non-null     float64
 7   col11      10 non-null     object
dtypes: float64(6), int64(1), object(1)
memory usage: 1.0 KB

In [43]:
lst_lst=[
    [25252543, 'hola', 743],
    [8754639, 'adios', 54353],
    [7543687, 'alegre', 43354]
]

In [47]:
df_lst=pd.DataFrame(lst_lst, columns=columnas[:3])  # dataframe desde lista

df_lst

       col1    col2   col3
0  25252543    hola    743
1   8754639   adios  54353
2   7543687  alegre  43354

In [48]:
dictio={'casa':lst_lst[0], 'ofi':lst_lst[1], 'numero':lst_lst[2]}

dictio

{'casa': [25252543, 'hola', 743],
 'ofi': [8754639, 'adios', 54353],
 'numero': [7543687, 'alegre', 43354]}

In [49]:
df_dictio=pd.DataFrame(dictio)   # dataframe desde diccionario

df_dictio

       casa      ofi   numero
0  25252543  8754639  7543687
1      hola    adios   alegre
2       743    54353    43354

In [50]:
df_dictio=pd.DataFrame.from_dict(dictio)

df_dictio

       casa      ofi   numero
0  25252543  8754639  7543687
1      hola    adios   alegre
2       743    54353    43354

In [55]:
# hacerlos iguales

dataf=pd.DataFrame(dictio)  # caragar el dict
  
dataf=dataf.T    # trasponer el dataframe

dataf.index=range(3)    # sobreescribir el indice

dataf.columns=columnas[:3]  # sobreescribir nombres de columna

dataf

       col1    col2   col3
0  25252543    hola    743
1   8754639   adios  54353
2   7543687  alegre  43354

In [63]:
dataf.rename(columns={'col1':'nuevo_nombre', 'col2': 'otro'})

  nuevo_nombre    otro   col3
0     25252543    hola    743
1      8754639   adios  54353
2      7543687  alegre  43354

**Operaciones**

In [64]:
df

       col1    col2   col3
0  25252543    hola    743
1   8754639   adios  54353
2   7543687  alegre  43354

In [65]:
df.T   # traspuesto

             0        1        2
col1  25252543  8754639  7543687
col2      hola    adios   alegre
col3       743    54353    43354

In [67]:
df.transpose()

             0        1        2
col1  25252543  8754639  7543687
col2      hola    adios   alegre
col3       743    54353    43354

In [69]:
df.sum()   # suma por columna

col1           41550869
col2    holaadiosalegre
col3              98450
dtype: object

In [72]:
df.sum(axis=1)   # suma por fila sin error, se salta una columna

0    25253286
1     8808992
2     7587041
dtype: int64

In [73]:
df.std()

col1    9.893186e+06
col3    2.831580e+04
dtype: float64

In [74]:
df.median()

col1    8754639.0
col3      43354.0
dtype: float64

In [75]:
df.mode()

       col1    col2   col3
0   7543687   adios    743
1   8754639  alegre  43354
2  25252543    hola  54353

In [80]:
df.var()

col1    9.787514e+13
col3    8.017846e+08
dtype: float64

In [81]:
df.max()

col1    25252543
col2        hola
col3       54353
dtype: object

In [82]:
df.min()

col1    7543687
col2      adios
col3        743
dtype: object

**Importar archivos**

+ csv
+ xlsx
+ xls
+ json

In [86]:
import warnings
warnings.simplefilter('ignore')

In [87]:
# csv

df_csv=pd.read_csv('../data/vehicles_messy.csv', sep=',')

df_csv.head()

,barrels08,barrelsA08,charge120,charge240,city08,city08U,cityA08,cityA08U,cityCD,cityE,...,mfrCode,c240Dscr,charge240b,c240bDscr,createdOn,modifiedOn,startStop,phevCity,phevHwy,phevComb
0,15.695714,0.0,0.0,0.0,19,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
1,29.964545,0.0,0.0,0.0,9,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
2,12.207778,0.0,0.0,0.0,23,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
3,29.964545,0.0,0.0,0.0,10,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0
4,17.347895,0.0,0.0,0.0,17,0.0,0,0.0,0.0,0.0,...,NaN,NaN,0.0,NaN,Tue Jan 01 00:00:00 EST 2013,Tue Jan 01 00:00:00 EST 2013,NaN,0,0,0

In [88]:
# xlsx

df_xlsx=pd.read_excel('../data/Online Retail.xlsx')

df_xlsx.head()

,InvoiceNo,InvoiceDate,StockCode,Description,Quantity,UnitPrice,Revenue,CustomerID,Country
0,536365,2010-12-01 08:26:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
1,536373,2010-12-01 09:02:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
2,536375,2010-12-01 09:32:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,6,2.55,15.3,17850,United Kingdom
3,536390,2010-12-01 10:19:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,64,2.55,163.2,17511,United Kingdom
4,536394,2010-12-01 10:39:00,85123A,CREAM HANGING HEART T-LIGHT HOLDER,32,2.55,81.6,13408,United Kingdom

In [89]:
# xls

df_xls=pd.read_excel('../data/Sensor Data.xls')   # primera hoja

df_xls.head()

,Input 1,Input 2,Input 3,Input 4,Input 5,Input 6,Input 7,Input 8,Input 9,Input 10,Input 11,Input 12,output1,output2,class
0,1.473,2.311,3.179,2.666,0.2795,0.2771,0.22340,0.1855,0.2539,1.138,1.111,4.712,1,1,one
1,1.460,2.377,3.214,2.920,0.2527,0.3064,0.02563,0.1965,0.3027,1.213,1.027,5.463,1,1,one
2,1.552,2.164,3.064,2.745,0.2820,0.2100,0.17210,0.1929,0.2100,1.221,1.058,5.332,1,1,one
3,1.605,2.228,3.149,2.834,0.2917,0.3613,0.20870,0.1294,0.2734,1.144,1.062,4.829,1,1,one
4,1.534,2.114,3.309,2.976,0.2100,0.2502,0.22580,0.1770,0.2039,1.254,1.112,5.734,1,1,one

In [90]:
df_xls_1=pd.read_excel('../data/Sensor Data.xls', 'Sheet1')   # primera hoja

df_xls_1.head()

,Input 1,Input 2,Input 3,Input 4,Input 5,Input 6,Input 7,Input 8,Input 9,Input 10,Input 11,Input 12,output1,output2,class
0,1.473,2.311,3.179,2.666,0.2795,0.2771,0.22340,0.1855,0.2539,1.138,1.111,4.712,1,1,one
1,1.460,2.377,3.214,2.920,0.2527,0.3064,0.02563,0.1965,0.3027,1.213,1.027,5.463,1,1,one
2,1.552,2.164,3.064,2.745,0.2820,0.2100,0.17210,0.1929,0.2100,1.221,1.058,5.332,1,1,one
3,1.605,2.228,3.149,2.834,0.2917,0.3613,0.20870,0.1294,0.2734,1.144,1.062,4.829,1,1,one
4,1.534,2.114,3.309,2.976,0.2100,0.2502,0.22580,0.1770,0.2039,1.254,1.112,5.734,1,1,one

In [92]:
df_xls_2=pd.read_excel('../data/Sensor Data.xls', 'Sheet2')   

df_xls_2.head()

                                                    Sensor Data
0  The data source as well as the exact nature of...
1  Each data instance contains 12 real-valued inp...
2  represents a sensor designed to detect the pre...
3  of substances. As an alternative, the sensor r...
4  Substance 1 is represented by the value 'one' ...

In [93]:
df_xls_3=pd.read_excel('../data/Sensor Data.xls', 'Sheet3')   

df_xls_3.head()

Empty DataFrame
Columns: [hola]
Index: []

In [94]:
# json

df_json=pd.read_json('../data/companies.json', lines=True, orient='records')  # lee un json, mira por si tiene varias filas(varios dict en la lista) y orientalo como los registros

df_json.head()

,_id,name,permalink,crunchbase_url,homepage_url,blog_url,blog_feed_url,twitter_username,category_code,number_of_employees,...,offices,milestones,video_embeds,screenshots,external_links,partners,deadpooled_month,deadpooled_day,deadpooled_url,ipo
0,{'$oid': '52cdef7c4bab8bd675297d8a'},Wetpaint,abc2,http://www.crunchbase.com/company/wetpaint,http://wetpaint-inc.com,http://digitalquarters.net/,http://digitalquarters.net/feed/,BachelrWetpaint,web,47.0,...,"[{'description': '', 'address1': '710 - 2nd Av...","[{'id': 5869, 'description': 'Wetpaint named i...",[],"[{'available_sizes': [[[150, 86], 'assets/imag...",[{'external_url': 'http://www.geekwire.com/201...,[],NaN,NaN,NaN,NaN
1,{'$oid': '52cdef7c4bab8bd675297d8b'},AdventNet,abc3,http://www.crunchbase.com/company/adventnet,http://adventnet.com,,,manageengine,enterprise,600.0,...,"[{'description': 'Headquarters', 'address1': '...",[],[],"[{'available_sizes': [[[150, 94], 'assets/imag...",[],[],NaN,NaN,NaN,NaN
2,{'$oid': '52cdef7c4bab8bd675297d8c'},Zoho,abc4,http://www.crunchbase.com/company/zoho,http://zoho.com,http://blogs.zoho.com/,http://blogs.zoho.com/feed,zoho,software,1600.0,...,"[{'description': 'Headquarters', 'address1': '...","[{'id': 388, 'description': 'Zoho Reaches 2 Mi...","[{'embed_code': '<object width=""430"" height=""2...",[],[{'external_url': 'http://www.online-tech-tips...,[],NaN,NaN,NaN,NaN
3,{'$oid': '52cdef7c4bab8bd675297d8d'},Digg,digg,http://www.crunchbase.com/company/digg,http://www.digg.com,http://blog.digg.com/,http://blog.digg.com/?feed=rss2,digg,news,60.0,...,"[{'description': None, 'address1': '135 Missis...","[{'id': 9588, 'description': 'Another Digg Exe...","[{'embed_code': '<embed src=""http://blip.tv/pl...","[{'available_sizes': [[[117, 150], 'assets/ima...",[{'external_url': 'http://www.sociableblog.com...,[],NaN,NaN,None,None
4,{'$oid': '52cdef7c4bab8bd675297d8e'},Facebook,facebook,http://www.crunchbase.com/company/facebook,http://facebook.com,http://blog.facebook.com,http://blog.facebook.com/atom.php,facebook,social,5299.0,...,"[{'description': 'Headquarters', 'address1': '...","[{'id': 108, 'description': 'Facebook adds com...",[],"[{'available_sizes': [[[150, 68], 'assets/imag...",[{'external_url': 'http://latimesblogs.latimes...,[],NaN,NaN,,"{'valuation_amount': 104000000000, 'valuation_..."

In [97]:
df_json.offices[0]

[{'description': '',
  'address1': '710 - 2nd Avenue',
  'address2': 'Suite 1100',
  'zip_code': '98104',
  'city': 'Seattle',
  'state_code': 'WA',
  'country_code': 'USA',
  'latitude': 47.603122,
  'longitude': -122.333253},
 {'description': '',
  'address1': '270 Lafayette Street',
  'address2': 'Suite 505',
  'zip_code': '10012',
  'city': 'New York',
  'state_code': 'NY',
  'country_code': 'USA',
  'latitude': 40.7237306,
  'longitude': -73.9964312}]